app/controllers/entries_controller.rb

INSERT INTO "entries" ("meal_entry", "calories", "protiens", "carbohydrates", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_entry", "ss"], ["calories", 23], ["protiens", 32], ["carbohydrates", 32], ["fats", 323], ["created_at", "2021-12-28 18:17:05.309217"], ["updated_at", "2021-12-28 18:17:05.309217"]]
---
  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save

UPDATE "entries" SET "meal_entry" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["meal_entry", "Breakfast"], ["updated_at", "2021-12-28 18:18:05.175973"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @entry.update(entry_params)